In [1]:
import pandas as pd

In [2]:
data = {
    "name":["shikamaru", "choji", "temari", "kushina", "minato"],
    "age":[22, 24, 22, 54, 52],
    "relationship_type":["me", "brother", "Girlfriend", "mom","dad"]
}

df =pd.DataFrame(data)
df

        name  age relationship_type
0  shikamaru   22                me
1      choji   24           brother
2     temari   22        Girlfriend
3    kushina   54               mom
4     minato   52               dad

In [4]:
df[df["age"]>22]

      name  age relationship_type
1    choji   24           brother
3  kushina   54               mom
4   minato   52               dad

In [7]:
df["Maturity"] = (df["age"] > 18)
df

        name  age relationship_type  Maturity
0  shikamaru   22                me      True
1      choji   24           brother      True
2     temari   22        Girlfriend      True
3    kushina   54               mom      True
4     minato   52               dad      True

In [8]:
df["age"]

0    22
1    24
2    22
3    54
4    52
Name: age, dtype: int64

In [15]:
df["name"],df["age"]

(0    shikamaru
 1        choji
 2       temari
 3      kushina
 4       minato
 Name: name, dtype: object,
 0    22
 1    24
 2    22
 3    54
 4    52
 Name: age, dtype: int64)

In [26]:
average_age = df["age"].mean()
average_age

np.float64(34.8)